#include<bits/stdc++.h>
using namespace std;
string ph1[]={"新水平","新境界","新举措","新发展","新突破","新成绩","新成效","新方法","新成果","新形势","新要求","新期待","新关系","新体制","新机制","新知识","新本领","新进展","新实践","新风貌","新事物","新高度",""};
string ph2[]={"重要性","紧迫性","自觉性","主动性","坚定性","民族性","时代性","实践性","针对性","全局性","前瞻性","战略性","积极性","创造性","长期性","复杂性","艰巨性","可讲性","鼓动性","计划性","敏锐性","有效性",""};
string ph3[]={"法制化","规范化","制度化","程序化","集约化","正常化","有序化","智能化","优质化","常态化","科学化","年轻化","知识化","专业化","系统性","时效性",""};
string ph4[]={"热心","耐心","诚心","决心","红心","真心","公心","柔心","铁心","上心","用心","痛心","童心","好心","专心","坏心","爱心","良心","关心","核心","内心","外心","中心","忠心","衷心","甘心","攻心",""};
string ph5[]={"政治意识","政权意识","大局意识","忧患意识","责任意识","法律意识","廉洁意识","学习意识","上进意识","管理意识",""};
string ph6[]={"出发点","切入点","落脚点","着眼点","结合点","关键点","着重点","着力点","根本点","支撑点",""};
string ph7[]={"活动力","控制力","影响力","创造力","凝聚力","战斗力",""};
string sen1[]={"必将激发巨大热情，凝聚无穷力量，催生丰硕成果，展现全新魅力","是历史的必然、现实的选择、未来的方向",""};
string sen2[]={"以求真务实的态度，积极推进综合调研制度化","以为领导决策服务为目的，积极推进信息督查正常化","以体现办公室业务水平为责任 ，积极推进文秘工作程序化","以畅通安全为保障，积极推进机要保密工作智能化","以立此存照为借鉴，积极推进档案史志工作规范化","以解决问题为重点，积极推进信访工作有序化","以服务机关为宗旨，积极推进后勤服务优质化","以统筹兼顾为重点，积极推进法制工 作常态化",""};
string verb[]={"推进","推动","健全","统领","协调","统筹","转变","提高","实现","适应","改革","创新","扩大","加强","促进","巩固","保障","方向","取决于","完善","加快","振兴","崛起","分工","扶持","改善","调整","优化","解决","宣传","教育","发挥","支持","带动","帮助","深化","规范","强化","统筹","指导","服务","健全","确保","维护","优先","贯彻","实施","深化","保证","鼓励","引导","坚持","深化","强化","监督","管理","开展","规划","整合","理顺","推行","纠正","严格","满足","推广","遏制","整治","保护","健全","丰富","夯实","树立","尊重","制约","适应","发扬","拓宽","拓展","规范","改进","形成","逐步","实现","规范","坚持","调节","取缔","调控","把握","弘扬","借鉴","倡导","培育","打牢","武装","凝聚","激发","说服","感召","尊重","包容","树立","培育","发扬","提倡","营造","促进","唱响","主张","弘扬","通达","引导","疏导","着眼","吸引","塑造","搞好","履行","倾斜","惠及","简化","衔接","调处","关切","汇集","分析","排查","协商","化解","动员","联动","激发","增进","汲取","检验","保护","鼓励","完善","宽容","增强","融洽","凝聚","汇集","筑牢","考验","进取","凝聚","设置","吸纳","造就",""};
string noun[]={"本质属性","重要保证","总体布局","战略任务","内在要求","重要进展","决策部署","结合点","突出地位","指导思想","科学性","协调性","体制机制","基本方略","理念意识","基本路线","基本纲领","秩序","基本经验","出发点","落脚点","要务","核心","主体","积极因素","水平","方针","结构","增量","比重","规模","标准","办法","主体","作用","特色","差距","渠道","方式","主导","纽带","主体","载体","制度","需求","能力","负担","体系","重点","资源","职能","倾向","秩序","途径","活力","项目","工程","政策","项目","竞争力","环境","素质","权利","利益","权威","氛围","职能","作用","事权","需要","能力","基础","比重","长效机制","举措","要素","精神","根本","地位","成果","核心","精神","力量","纽带","思想","理想",""};
string lc[]={"同时","但是","虽然","而且","或者",""};
inline int len(string *s){for(int i=0;;++i)if(s[i].size()==0)return i;}
inline string Phrase(){
	int e=len(verb),f=len(noun);
	string rt=verb[rand()%e]+noun[rand()%f];
	return rt;
}
inline string Paibi(string *s){
	string rt="";
	int Len=2+rand()%2;
	for(int i=0;i<Len;++i){
		if(i)rt+="、";
		rt+=s[rand()%len(s)];
	}
	return rt;
}
int main(){
	srand(time(NULL));
	string zt;cin>>zt;
	int para=10;
	for(int i=0;i<para;++i){
		int sen=rand()%6+10;
		for(int j=0;j<sen;++j){
			int ee=rand()%128;
			int tp;
			if(ee<64)tp=0;
			else if(ee<96)tp=1;
			else if(ee<112)tp=2;
			else tp=3;
			if(tp==0){
				if(j==0);
				else cout<<lc[rand()%len(lc)]<<"，";
				int tt=6+rand()%6;
				for(int k=0;k<tt;++k){
					if(k)cout<<"、";
					cout<<Phrase();
				}
				cout<<"，也是"<<zt<<"的"<<noun[rand()%len(noun)];
			}
			if(tp==1){
				cout<<"我们还要"<<verb[rand()%len(verb)]<<zt<<"的"<<Paibi(ph6)<<"，"<<verb[rand()%len(verb)]<<zt<<"的"<<Paibi(noun)<<"，"<<verb[rand()%len(verb)]<<Paibi(ph4)<<"，从而"<<verb[rand()%len(verb)]<<Paibi(ph1);
			}
			if(tp==2){
				int le=2+rand()%3;
				for(int i=0;i<le;++i)cout<<verb[rand()%len(verb)];
				cout<<noun[rand()%len(noun)];
				cout<<"，"<<sen1[rand()%len(sen1)];
			}
			if(tp==3){ 
				cout<<verb[rand()%len(verb)]<<zt<<"的"<<Paibi(ph3)<<verb[rand()%len(verb)]<<"，"<<noun[rand()%len(noun)]<<"是"<<Paibi(sen2);
			}
			cout<<"。";
			
		}
		cout<<"\n\n";
	}
}
